; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v5 ?v9)
             (pred_6 ?v10 ?v13)
             (pred_8 ?v5 ?v13)
             (pred_12 ?v11 ?v5 )
	     (pred_3 ?v5)
             (pred_9 ?v3)
             (pred_1 ?v10)
             (pred_4 ?v13)
             (pred_5 ?v5)
             (pred_11 ?v10)
             (pred_7 ?v5)
             (pred_10 ))



(:action op_1
:parameters (?v4 ?v8 ?v12 ?v7)
:precondition (and (pred_9 ?v4) (pred_9 ?v8) (pred_1 ?v12) (pred_4 ?v7)
          (pred_2 ?v4 ?v8) (pred_6 ?v12 ?v7)
                   (pred_8 ?v8 ?v7) (pred_3 ?v4) 
                   (pred_5 ?v8) (pred_11 ?v12))
:effect (and  (pred_7 ?v8) (not (pred_5 ?v8))))


(:action op_5
:parameters (?v4 ?v1)
:precondition (and (pred_9 ?v4) (pred_9 ?v1)
               (pred_3 ?v4) (pred_2 ?v4 ?v1) (pred_7 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v4))))

(:action op_3
:parameters (?v4 ?v12)
:precondition (and (pred_9 ?v4) (pred_1 ?v12) 
                  (pred_3 ?v4) (pred_12 ?v12 ?v4) (pred_10 ))
:effect (and (pred_11 ?v12)
   (not (pred_12 ?v12 ?v4)) (not (pred_10 ))))


(:action op_4
:parameters (?v4 ?v6 ?v2)
:precondition (and (pred_9 ?v4) (pred_1 ?v6) (pred_1 ?v2)
                  (pred_3 ?v4) (pred_11 ?v2) (pred_12 ?v6 ?v4))
:effect (and (pred_11 ?v6) (pred_12 ?v2 ?v4)
        (not (pred_11 ?v2)) (not (pred_12 ?v6 ?v4))))

(:action op_2
:parameters (?v4 ?v12)
:precondition (and (pred_9 ?v4) (pred_1 ?v12) 
                  (pred_3 ?v4) (pred_11 ?v12))
:effect (and (pred_10 ) (pred_12 ?v12 ?v4) (not (pred_11 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_04 obj_18 obj_20 obj_19 obj_06 obj_15 obj_10 obj_08 obj_16 obj_03 obj_13 obj_17 obj_11 obj_07 obj_05
    obj_02 obj_12
    obj_09 obj_21 obj_14
    )

    (:init
       (pred_10)

       (pred_9 obj_01)
       (pred_9 obj_04)
       (pred_9 obj_18)
       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_16)
       (pred_9 obj_03)
       (pred_9 obj_13)
       (pred_9 obj_17)
       (pred_9 obj_11)
       (pred_9 obj_07)
       (pred_9 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_14)

       (pred_2 obj_01 obj_19)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_04 obj_06)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_18 obj_15)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_20 obj_10)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_06 obj_04)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_15 obj_03)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_18)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_10 obj_13)
       (pred_2 obj_10 obj_20)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_08 obj_17)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_03)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_03 obj_07)
       (pred_2 obj_03 obj_13)
       (pred_2 obj_03 obj_15)
       (pred_2 obj_03 obj_16)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_13 obj_03)
       (pred_2 obj_17 obj_11)
       (pred_2 obj_17 obj_08)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_17)
       (pred_2 obj_07 obj_05)
       (pred_2 obj_07 obj_03)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_05 obj_07)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_07)
       (pred_8  obj_01 obj_02)
       (pred_8  obj_15 obj_12)
       (pred_8  obj_07 obj_02)
       (pred_7 obj_04)
       (pred_7 obj_18)
       (pred_7 obj_20)
       (pred_7 obj_19)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_7 obj_08)
       (pred_7 obj_16)
       (pred_7 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_17)
       (pred_7 obj_11)
       (pred_7 obj_05)

       (pred_6  obj_09 obj_02)
       (pred_6  obj_21 obj_12)
       (pred_6  obj_14 obj_12)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_14 obj_20)
       (pred_3 obj_04)
    )

    (:goal (and
       (pred_12 obj_09 obj_17)
       (pred_12 obj_21 obj_16)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_5 obj_04 obj_18)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_18)
   goals met: 0 of 2
2. (op_5 obj_18 obj_20)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_20)
   goals met: 0 of 2
3. (op_3 obj_20 obj_21)
   deleted: (pred_12 obj_21 obj_20) (pred_10)
   added: (pred_11 obj_21)
   goals met: 0 of 2
4. (op_5 obj_20 obj_10)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_10)
   goals met: 0 of 2
5. (op_1 obj_10 obj_15 obj_21 obj_12)
   deleted: (pred_5 obj_15)
   added: (pred_7 obj_15)
   goals met: 0 of 2
6. (op_5 obj_10 obj_15)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_15)
   goals met: 0 of 2
7. (op_5 obj_15 obj_03)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_03)
   goals met: 0 of 2
8. (op_5 obj_03 obj_16)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_16)
   goals met: 0 of 2
9. (op_2 obj_16 obj_21)
   deleted: (pred_11 obj_21)
   added: (pred_10) (pred_12 obj_21 obj_16)
   goals met: 1 of 2
10. (op_5 obj_16 obj_06)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_06)
   goals met: 1 of 2
11. (op_5 obj_06 obj_15)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_15)
   goals met: 1 of 2
12. (op_5 obj_15 obj_10)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_10)
   goals met: 1 of 2
13. (op_3 obj_10 obj_09)
   deleted: (pred_12 obj_09 obj_10) (pred_10)
   added: (pred_11 obj_09)
   goals met: 1 of 2
14. (op_5 obj_10 obj_15)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_15)
   goals met: 1 of 2
15. (op_5 obj_15 obj_06)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_06)
   goals met: 1 of 2
16. (op_5 obj_06 obj_19)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_19)
   goals met: 1 of 2
17. (op_5 obj_19 obj_08)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_08)
   goals met: 1 of 2
18. (op_5 obj_08 obj_17)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_17)
   goals met: 1 of 2
19. (op_2 obj_17 obj_09)
   deleted: (pred_11 obj_09)
   added: (pred_10) (pred_12 obj_09 obj_17)
   goals met: 2 of 2
